In [9]:
import numpy as np
from numpy.random import randn

import pandas as pd

In [10]:
randn(5,4)

array([[ 0.1023264 , -0.43533566, -1.11921599,  0.50734832],
       [ 1.02378144, -0.8113699 ,  0.53972943,  1.80011543],
       [-0.33476682, -1.05683531,  0.94545361,  1.91955365],
       [-0.6488453 , -0.01914984,  0.38457927, -0.54337062],
       [-0.17650243, -1.79174154,  1.85447152, -0.59476984]])

In [18]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -1.655802 -1.262567  0.908568  0.729019
B -1.326866 -0.499523  0.452843 -0.175267
C  0.218238  1.187488  0.371255  0.476986
D  1.108922  0.382043  0.457482 -0.089097
E -1.871739 -0.072558  0.664499 -0.641500

In [28]:
df['W']

A   -1.655802
B   -1.326866
C    0.218238
D    1.108922
E   -1.871739
Name: W, dtype: float64

In [27]:
df[['W','X']]

          W         X
A -1.655802 -1.262567
B -1.326866 -0.499523
C  0.218238  1.187488
D  1.108922  0.382043
E -1.871739 -0.072558

In [47]:
df['new'] = df['W'] + df['X']
df

          W         X         Y         Z       New       new
A -1.655802 -1.262567  0.908568  0.729019 -2.918369 -2.918369
B -1.326866 -0.499523  0.452843 -0.175267 -1.826389 -1.826389
C  0.218238  1.187488  0.371255  0.476986  1.405726  1.405726
D  1.108922  0.382043  0.457482 -0.089097  1.490964  1.490964
E -1.871739 -0.072558  0.664499 -0.641500 -1.944297 -1.944297

In [48]:
df.drop('new', axis=1)

          W         X         Y         Z       New
A -1.655802 -1.262567  0.908568  0.729019 -2.918369
B -1.326866 -0.499523  0.452843 -0.175267 -1.826389
C  0.218238  1.187488  0.371255  0.476986  1.405726
D  1.108922  0.382043  0.457482 -0.089097  1.490964
E -1.871739 -0.072558  0.664499 -0.641500 -1.944297

In [49]:
df

          W         X         Y         Z       New       new
A -1.655802 -1.262567  0.908568  0.729019 -2.918369 -2.918369
B -1.326866 -0.499523  0.452843 -0.175267 -1.826389 -1.826389
C  0.218238  1.187488  0.371255  0.476986  1.405726  1.405726
D  1.108922  0.382043  0.457482 -0.089097  1.490964  1.490964
E -1.871739 -0.072558  0.664499 -0.641500 -1.944297 -1.944297

In [50]:
df.drop('New',axis=1,inplace=True) # inplace=True, removes the column and updates variable.
df

          W         X         Y         Z       new
A -1.655802 -1.262567  0.908568  0.729019 -2.918369
B -1.326866 -0.499523  0.452843 -0.175267 -1.826389
C  0.218238  1.187488  0.371255  0.476986  1.405726
D  1.108922  0.382043  0.457482 -0.089097  1.490964
E -1.871739 -0.072558  0.664499 -0.641500 -1.944297

In [51]:
df.drop('E')

          W         X         Y         Z       new
A -1.655802 -1.262567  0.908568  0.729019 -2.918369
B -1.326866 -0.499523  0.452843 -0.175267 -1.826389
C  0.218238  1.187488  0.371255  0.476986  1.405726
D  1.108922  0.382043  0.457482 -0.089097  1.490964

In [52]:
df

          W         X         Y         Z       new
A -1.655802 -1.262567  0.908568  0.729019 -2.918369
B -1.326866 -0.499523  0.452843 -0.175267 -1.826389
C  0.218238  1.187488  0.371255  0.476986  1.405726
D  1.108922  0.382043  0.457482 -0.089097  1.490964
E -1.871739 -0.072558  0.664499 -0.641500 -1.944297

In [53]:
df.drop('E',inplace=True)

In [54]:
df

          W         X         Y         Z       new
A -1.655802 -1.262567  0.908568  0.729019 -2.918369
B -1.326866 -0.499523  0.452843 -0.175267 -1.826389
C  0.218238  1.187488  0.371255  0.476986  1.405726
D  1.108922  0.382043  0.457482 -0.089097  1.490964

In [55]:
df.shape

(4, 5)

In [57]:
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A -1.655802 -1.262567  0.908568  0.729019
B -1.326866 -0.499523  0.452843 -0.175267
C  0.218238  1.187488  0.371255  0.476986
D  1.108922  0.382043  0.457482 -0.089097

In [59]:
df.loc['C']

W    0.218238
X    1.187488
Y    0.371255
Z    0.476986
Name: C, dtype: float64

In [61]:
df.iloc[2]

W    0.218238
X    1.187488
Y    0.371255
Z    0.476986
Name: C, dtype: float64

In [63]:
df.loc['C','W']

0.21823820644967262

In [64]:
df

          W         X         Y         Z
A -1.655802 -1.262567  0.908568  0.729019
B -1.326866 -0.499523  0.452843 -0.175267
C  0.218238  1.187488  0.371255  0.476986
D  1.108922  0.382043  0.457482 -0.089097

In [65]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -1.655802  0.908568
B -1.326866  0.452843

In [66]:
df

          W         X         Y         Z
A -1.655802 -1.262567  0.908568  0.729019
B -1.326866 -0.499523  0.452843 -0.175267
C  0.218238  1.187488  0.371255  0.476986
D  1.108922  0.382043  0.457482 -0.089097

In [69]:
booldf = df > 0
booldf

       W      X     Y      Z
A  False  False  True   True
B  False  False  True  False
C   True   True  True   True
D   True   True  True  False

In [71]:
df[booldf]

          W         X         Y         Z
A       NaN       NaN  0.908568  0.729019
B       NaN       NaN  0.452843       NaN
C  0.218238  1.187488  0.371255  0.476986
D  1.108922  0.382043  0.457482       NaN

In [73]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN  0.908568  0.729019
B       NaN       NaN  0.452843       NaN
C  0.218238  1.187488  0.371255  0.476986
D  1.108922  0.382043  0.457482       NaN

In [75]:
df['W']>0

A    False
B    False
C     True
D     True
Name: W, dtype: bool

In [76]:
df['W']

A   -1.655802
B   -1.326866
C    0.218238
D    1.108922
Name: W, dtype: float64

In [78]:
df

          W         X         Y         Z
A -1.655802 -1.262567  0.908568  0.729019
B -1.326866 -0.499523  0.452843 -0.175267
C  0.218238  1.187488  0.371255  0.476986
D  1.108922  0.382043  0.457482 -0.089097

In [77]:
df[df['W']>0] # On column W, only show rows that are >0 aka True

          W         X         Y         Z
C  0.218238  1.187488  0.371255  0.476986
D  1.108922  0.382043  0.457482 -0.089097

In [79]:
df

          W         X         Y         Z
A -1.655802 -1.262567  0.908568  0.729019
B -1.326866 -0.499523  0.452843 -0.175267
C  0.218238  1.187488  0.371255  0.476986
D  1.108922  0.382043  0.457482 -0.089097

In [82]:
result = df[df['Z']<0]
result

          W         X         Y         Z
B -1.326866 -0.499523  0.452843 -0.175267
D  1.108922  0.382043  0.457482 -0.089097

In [83]:
result['X']

B   -0.499523
D    0.382043
Name: X, dtype: float64

In [84]:
df[df['Z']<0]['X']

B   -0.499523
D    0.382043
Name: X, dtype: float64

In [86]:
df[df['Z']<0][['X','Y']]

          X         Y
B -0.499523  0.452843
D  0.382043  0.457482

In [102]:
df['ZZ'] = df['Z']*2 
df

          W         X         Y         Z        ZZ
A -1.655802 -1.262567  0.908568  0.729019  1.458039
B -1.326866 -0.499523  0.452843 -0.175267 -0.350534
C  0.218238  1.187488  0.371255  0.476986  0.953972
D  1.108922  0.382043  0.457482 -0.089097 -0.178195

In [103]:
# and is &

In [105]:
# or is | (pipe character)

In [107]:
df.reset_index()

  index         W         X         Y         Z        ZZ
0     A -1.655802 -1.262567  0.908568  0.729019  1.458039
1     B -1.326866 -0.499523  0.452843 -0.175267 -0.350534
2     C  0.218238  1.187488  0.371255  0.476986  0.953972
3     D  1.108922  0.382043  0.457482 -0.089097 -0.178195

In [113]:
newindex = 'CA NY FL OR'.split() # nice and quick way of creating a list
newindex

['CA', 'NY', 'FL', 'OR']

In [114]:
df['States'] = newindex

In [115]:
df

          W         X         Y         Z        ZZ States
A -1.655802 -1.262567  0.908568  0.729019  1.458039     CA
B -1.326866 -0.499523  0.452843 -0.175267 -0.350534     NY
C  0.218238  1.187488  0.371255  0.476986  0.953972     FL
D  1.108922  0.382043  0.457482 -0.089097 -0.178195     OR

In [118]:
df.drop('ZZ',axis=1,inplace=True)

In [119]:
df

          W         X         Y         Z States
A -1.655802 -1.262567  0.908568  0.729019     CA
B -1.326866 -0.499523  0.452843 -0.175267     NY
C  0.218238  1.187488  0.371255  0.476986     FL
D  1.108922  0.382043  0.457482 -0.089097     OR

In [120]:
df.set_index('States') # it's not in place

               W         X         Y         Z
States
CA     -1.655802 -1.262567  0.908568  0.729019
NY     -1.326866 -0.499523  0.452843 -0.175267
FL      0.218238  1.187488  0.371255  0.476986
OR      1.108922  0.382043  0.457482 -0.089097

In [121]:
df

          W         X         Y         Z States
A -1.655802 -1.262567  0.908568  0.729019     CA
B -1.326866 -0.499523  0.452843 -0.175267     NY
C  0.218238  1.187488  0.371255  0.476986     FL
D  1.108922  0.382043  0.457482 -0.089097     OR

In [122]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [123]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [124]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [125]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [126]:
df

             A         B
G1 1  1.254918 -1.752505
   2 -0.070230 -1.359984
   3  0.187836 -0.906213
G2 1 -0.243534  0.134441
   2  0.732717  2.444243
   3  0.828102  0.533858

In [127]:
df.loc['G1']

          A         B
1  1.254918 -1.752505
2 -0.070230 -1.359984
3  0.187836 -0.906213

In [129]:
df.loc['G1'].loc[3]

A    0.187836
B   -0.906213
Name: 3, dtype: float64

In [130]:
df.index.names

FrozenList([None, None])

In [131]:
df.index.names = ['Groups', 'Num']

In [132]:
df

                   A         B
Groups Num
G1     1    1.254918 -1.752505
       2   -0.070230 -1.359984
       3    0.187836 -0.906213
G2     1   -0.243534  0.134441
       2    0.732717  2.444243
       3    0.828102  0.533858

In [136]:
df.loc['G2'].loc[2]['B']

2.4442426591281916

In [137]:
df.xs

<bound method NDFrame.xs of                    A         B
Groups Num
G1     1    1.254918 -1.752505
       2   -0.070230 -1.359984
       3    0.187836 -0.906213
G2     1   -0.243534  0.134441
       2    0.732717  2.444243
       3    0.828102  0.533858>

In [139]:
df.xs(2,level='Num')

               A         B
Groups
G1     -0.070230 -1.359984
G2      0.732717  2.444243